IRP/src/Catalogs/ObjectStatuses/ObjectStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ObjectStatuses</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>SalesOrder</name>
      <description>Sales order</description>
    </items>
    <items>
      <name>SalesReturnOrder</name>
      <description>Sales return order</description>
    </items>
    <items>
      <name>PurchaseOrder</name>
      <description>Purchase order</description>
    </items>
    <items>
      <name>PurchaseReturnOrder</name>
      <description>Purchase return order</description>
    </items>
    <items>
      <name>InventoryTransferOrder</name>
      <description>Inventory transfer order</description>
    </items>
    <items>
      <name>OutgoingPaymentOrder</name>
      <description>Outgoing payment order</description>
    </items>
    <items>
      <name>ReconciliationStatement</name>
      <description>Reconciliation statement</description>
    </items>
    <items>
      <name>PhysicalCountByLocation</name>
      <description>Physical count by location</description>
    </items>
    <items>
      <name>PhysicalInventory</name>
      <description>Physical inventory</description>
    </items>
    <items>
      <name>IncomingPaymentOrder</name>
      <description>Incoming payment order</description>
    </items>
    <items>
      <name>ChequeBondTransaction</name>
    </items>
  </predefined>
  <attributes>
    <name>SetByDefault</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Posting</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PostingChequeBondBalance</name>
    <type>
      <types>EnumRef.DocumentPostingTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PostingVendorTransactions</name>
    <type>
      <types>EnumRef.DocumentPostingTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PostingCustomerTransactions</name>
    <type>
      <types>EnumRef.DocumentPostingTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PostingCashPlanning</name>
    <type>
      <types>EnumRef.DocumentPostingTypes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>NextPossibleStatuses</name>
    <attributes>
      <name>Status</name>
      <type>
        <types>CatalogRef.ObjectStatuses</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Enums/DocumentPostingTypes/DocumentPostingTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>DocumentPostingTypes</name>
 <enumValues>
  <name>Posting</name>
 </enumValues>
 <enumValues>
  <name>Reversal</name>
 </enumValues>
 <enumValues>
  <name>Nothing</name>
 </enumValues>
 <enumValues>
  <name>Correction</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/ObjectStatuses/ObjectModule.bsl
Procedure BeforeWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;

	If ThisObject.IsFolder Or (ThisObject.AdditionalProperties.Property("WriteMode")
		And ThisObject.AdditionalProperties.WriteMode = "Service") Then
		Return;
	EndIf;

	Query = New Query();
	Query.Text =
	"SELECT
	|	ObjectStatuses.Ref
	|FROM
	|	Catalog.ObjectStatuses AS ObjectStatuses
	|WHERE
	|	ObjectStatuses.SetByDefault
	|	AND ObjectStatuses.Parent = &Parent
	|	AND ObjectStatuses.Ref <> &Ref";

	Query.SetParameter("Parent", ThisObject.Parent);
	Query.SetParameter("Ref", ThisObject.Ref);
	QueryResult = Query.Execute();

	QueryTable = QueryResult.Unload();

	DataLock = New DataLock();
	ItemLock = DataLock.Add("Catalog.ObjectStatuses");
	ItemLock.Mode = DataLockMode.Exclusive;
	ItemLock.DataSource = QueryTable;
	ItemLock.UseFromDataSource("Ref", "Ref");
	DataLock.Lock();

	If Not QueryTable.Count() Then
		ThisObject.SetByDefault = True;
	Else
		If ThisObject.SetByDefault Then
			For Each Row In QueryTable Do
				OtherObject = Row.Ref.GetObject();
				OtherObject.SetByDefault = False;
				OtherObject.AdditionalProperties.Insert("WriteMode", "Service");
				Try
					OtherObject.Write();
				Except
					Cancel = True;
					Message = StrTemplate(R().Error_009, String(ErrorInfo()));
					CommonFunctionsClientServer.ShowUsersMessage(Message);
					Return;
				EndTry;
			EndDo;
		EndIf;
	EndIf;
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	If ThisObject.IsFolder Then
		Index = CheckedAttributes.Find("Parent");
		If Index <> Undefined Then
			CheckedAttributes.Delete(Index);
		EndIf;
	EndIf;
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	If ThisObject.IsFolder Then
		Return;
	EndIf;
	
	ThisObject.PostingChequeBondBalance    = Enums.DocumentPostingTypes.Nothing;
	ThisObject.PostingVendorTransactions   = Enums.DocumentPostingTypes.Nothing;
	ThisObject.PostingCustomerTransactions = Enums.DocumentPostingTypes.Nothing;
	ThisObject.PostingCashPlanning         = Enums.DocumentPostingTypes.Nothing;
EndProcedure

Procedure OnCopy(CopiedObject)
	CopiedObject.UniqueID = Undefined;
EndProcedure
